<?php
// トランプは4つのスート（マーク）、1〜13までの数字の52枚である。
$cards = [
    "A","2","3","4","5","6","7","8","9","10","J","Q","K",
    "A","2","3","4","5","6","7","8","9","10","J","Q","K",
    "A","2","3","4","5","6","7","8","9","10","J","Q","K",
    "A","2","3","4","5","6","7","8","9","10","J","Q","K",
    ];

// 配列の順番をシャッフルする 
// 最初にトランプをシャッフル
shuffle($cards);

// 繰り返しで表示
// foreach($cards as $value){
//     echo $value . "\n";
// }


// 2枚を先頭から順番に引き
$first = $cards[0];
$secound = $cards[1];

// JとQとKは10、Aは1か11
// Aはとりあえず11として合計値を計算し、21を超える場合は1として数える（合計値から10を引く）
if($first == "J" || $first == "Q" || $first == "K"){
    $first = 10;
}
if($first == "A"){
    $first = 11;
}
if($secound == "J" || $secound == "Q" || $secound == "K"){
    $secound = 10;
}
if($secound == "A"){
    $secound = 11;
}
$total = $first + $secound; 

if($total > 21){
    $total = $total - 10;
}


// それらのカードの数字（マークは無視してよい）と合計値を表示する
echo $cards[0] . " " . $cards[1] .  " : 合計" . $total;









