<?php

// トランプは4つのスート（マーク）、1〜13までの数字の52枚である。
$cards = [
    "クローバーA","クローバー2","クローバー2","クローバー4","クローバー5","クローバー6","クローバー7","クローバー8","クローバー9","クローバー10","クローバーJ","クローバーQ","クローバーK",
    "ダイヤA","ダイヤ2","ダイヤ3","ダイヤ4","ダイヤ5","ダイヤ6","ダイヤ7","ダイヤ8","ダイヤ9","ダイヤ10","ダイヤJ","ダイヤQ","ダイヤK",
    "スペードA","スペード2","スペード3","スペード4","スペード5","スペード6","スペード7","スペード8","スペード9","スペード10","スペードJ","スペードQ","スペードK",
    "ハートA","ハート2","ハート3","ハート4","ハート5","ハート6","ハート7","ハート8","ハート9","ハート10","ハートJ","ハートQ","ハートK",
    ];

// 配列の順番をシャッフルする
shuffle($cards);

// 繰り返しで表示
foreach($cards as $value){
    echo $value . "\n";
}